[[{"relationship": "Trajectories 0 and 0 are identical, showing the exact same path and endpoints in 3D space.", "A": 0, "B": 0}, {"relationship": " Trajectories 0 and 1 share a similar starting point but diverge into different paths with distinct ending points in 3D space. ", "A": 0, "B": 1}, {"relationship": " Trajectories 0 and 2 have different starting points, but both end with a sharp vertical movement to a similar high point. ", "A": 0, "B": 2}, {"relationship": " Trajectories 0 and 3 start close together but diverge, with trajectory 3 having a loop-like structure that 0 lacks. ", "A": 0, "B": 3}, {"relationship": " Trajectories 0 and 4 have slightly different starting locations, but share a similar path, with trajectory 4 being slightly more spread out. ", "A": 0, "B": 4}, {"relationship": " Trajectories 0 and 5 have different movement styles, with trajectory 5 having a more box-like direction. ", "A": 0, "B": 5}, {"relationship": " Trajectories 0 and 6 have a similar ending, with trajectory 6 covering a wider spread of the x-axis. ", "A": 0, "B": 6}, {"relationship": " Trajectories 0 and 7 start at different points, but have a similar end goal. ", "A": 0, "B": 7}, {"relationship": " Trajectories 0 and 8 start off close, however, their paths differ with trajectory 8 taking a more zig-zag shape. ", "A": 0, "B": 8}, {"relationship": " Trajectories 0 and 9 appear to be close on the xy-axis but have different z-axis values; moreover, trajectory 9 starts and ends at slightly different locations on the graph. ", "A": 0, "B": 9}], [{"relationship": " Trajectories 1 and 0 share a similar starting point but diverge into different paths with distinct ending points in 3D space. ", "A": 1, "B": 0}, {"relationship": " Trajectories 1 and 1 are identical, showing the exact same path and endpoints in 3D space.", "A": 1, "B": 1}, {"relationship": " Trajectories 1 and 2 have similar endpoints, however, trajectory 2 is slightly more spread out along the x-axis. ", "A": 1, "B": 2}, {"relationship": " Trajectories 1 and 3 have very different paths and starting points; their ending points, although similar, are on different z-values on the graph. ", "A": 1, "B": 3}, {"relationship": " Trajectories 1 and 4 have very different paths and ending points but are mostly near the same xy-axis values. ", "A": 1, "B": 4}, {"relationship": " Trajectories 1 and 5 have slightly different endpoints, with trajectory 5 having a more box-like direction. ", "A": 1, "B": 5}, {"relationship": " Trajectories 1 and 6 are totally different in trajectory direction, and distance, however, they end at nearly the same z-axis height on the graph. ", "A": 1, "B": 6}, {"relationship": " Trajectories 1 and 7 have very different starting points but are not that far apart; however, both end at a similar z-height on the graph. ", "A": 1, "B": 7}, {"relationship": " Trajectories 1 and 8 have a lot of the same movement patterns, but have different starting points and are slightly different distances from the camera. ", "A": 1, "B": 8}, {"relationship": " Trajectories 1 and 9 share a similar beginning point but end at different point. ", "A": 1, "B": 9}], [{"relationship": " Trajectories 2 and 0 have different starting points, but both end with a sharp vertical movement to a similar high point. ", "A": 2, "B": 0}, {"relationship": " Trajectories 2 and 1 have similar endpoints, however, trajectory 2 is slightly more spread out along the x-axis. ", "A": 2, "B": 1}, {"relationship": " Trajectories 2 and 2 are identical, showing the exact same path and endpoints in 3D space. ", "A": 2, "B": 2}, {"relationship": " Trajectories 2 and 3 have drastically different starting points; they also have different trajectory patterns, but their end heights (z-axis value) is very similar. ", "A": 2, "B": 3}, {"relationship": " Trajectories 2 and 4 have different movement patterns, with trajectory 4 having more curves and an all-around less sharp direction. ", "A": 2, "B": 4}, {"relationship": " Trajectories 2 and 5 are similar ending height (z-axis value) on the graph. ", "A": 2, "B": 5}, {"relationship": " Trajectories 2 and 6 are different trajectory path wise; also, trajectory 6 is on the left side of the graph while trajectory 2 is more center-based. ", "A": 2, "B": 6}, {"relationship": " Trajectories 2 and 7 have similar ending z-axis heights but start at different points on the xy-axis. ", "A": 2, "B": 7}, {"relationship": " Trajectories 2 and 8 have different trajectory styles with the former being sharp, while the latter is less angular. ", "A": 2, "B": 8}, {"relationship": " Trajectories 2 and 9 are very similar in that one point is closer than the other; overall, they appear to be close and in the same xy-axis. ", "A": 2, "B": 9}], [{"relationship": " Trajectories 3 and 0 start close together but diverge, with trajectory 3 having a loop-like structure that 0 lacks. ", "A": 3, "B": 0}, {"relationship": " Trajectories 3 and 1 have very different paths and starting points; their ending points, although similar, are on different z-values on the graph. ", "A": 3, "B": 1}, {"relationship": " Trajectories 3 and 2 have drastically different starting points; they also have different trajectory patterns, but their end heights (z-axis value) is very similar. ", "A": 3, "B": 2}, {"relationship": " Trajectories 3 and 3 are identical, showing the exact same path and endpoints in 3D space. ", "A": 3, "B": 3}, {"relationship": " Trajectories 3 and 4 both have a similar trajectory style; however, trajectory 4 has the shape spread out more, and the starting point is much further away from the camera. ", "A": 3, "B": 4}, {"relationship": " Trajectories 3 and 5 have vastly different starting points, and directions of trajectory. ", "A": 3, "B": 5}, {"relationship": " Trajectories 3 and 6 start at opposite sides of the graph in that trajectory 3 starts more on the left, and trajectory 6 starts on the right side of the graph. ", "A": 3, "B": 6}, {"relationship": " Trajectories 3 and 7 have different starting points but the ending z-axis height is the same. ", "A": 3, "B": 7}, {"relationship": " Trajectories 3 and 8 have different starting points but the same ending height on the z-axis of the graph. ", "A": 3, "B": 8}, {"relationship": " Trajectories 3 and 9 have drastic differences, with trajectory 3 having a loop while trajectory 9 does not. ", "A": 3, "B": 9}], [{"relationship": " Trajectories 4 and 0 have slightly different starting locations, but share a similar path, with trajectory 4 being slightly more spread out. ", "A": 4, "B": 0}, {"relationship": " Trajectories 4 and 1 have very different paths and ending points but are mostly near the same xy-axis values. ", "A": 4, "B": 1}, {"relationship": " Trajectories 4 and 2 have different movement patterns, with trajectory 4 having more curves and an all-around less sharp direction. ", "A": 4, "B": 2}, {"relationship": " Trajectories 4 and 3 both have a similar trajectory style; however, trajectory 4 has the shape spread out more, and the starting point is much further away from the camera. ", "A": 4, "B": 3}, {"relationship": " Trajectories 4 and 4 are identical, showing the exact same path and endpoints in 3D space. ", "A": 4, "B": 4}, {"relationship": " Trajectories 4 and 5 have a similar trajectory style but have starting points in completely different areas. ", "A": 4, "B": 5}, {"relationship": " Trajectories 4 and 6 are similar to a certain extent, however, their direction varies near the halfway point. ", "A": 4, "B": 6}, {"relationship": " Trajectories 4 and 7 have similar end points with slightly different starting points. ", "A": 4, "B": 7}, {"relationship": " Trajectories 4 and 8 have different trajectory patterns but are similar in xy-axis values. ", "A": 4, "B": 8}, {"relationship": " Trajectories 4 and 9 have very different trajectory patterns; in addition, the starting points are on opposite sides of the graph. ", "A": 4, "B": 9}], [{"relationship": " Trajectories 5 and 0 have different movement styles, with trajectory 5 having a more box-like direction. ", "A": 5, "B": 0}, {"relationship": " Trajectories 5 and 1 have slightly different endpoints, with trajectory 5 having a more box-like direction. ", "A": 5, "B": 1}, {"relationship": " Trajectories 5 and 2 are similar ending height (z-axis value) on the graph. ", "A": 5, "B": 2}, {"relationship": " Trajectories 5 and 3 have vastly different starting points, and directions of trajectory. ", "A": 5, "B": 3}, {"relationship": " Trajectories 5 and 4 have a similar trajectory style but have starting points in completely different areas. ", "A": 5, "B": 4}, {"relationship": " Trajectories 5 and 5 are identical, showing the exact same path and endpoints in 3D space. ", "A": 5, "B": 5}, {"relationship": " Trajectories 5 and 6 have different xy-axis values. ", "A": 5, "B": 6}, {"relationship": " Trajectories 5 and 7 have different starting point, but they have very similar ending heights on the z-axis. ", "A": 5, "B": 7}, {"relationship": " Trajectories 5 and 8 have different path patterns in that trajectory 8 has sharp turns, and trajectory 5 has more of a box. ", "A": 5, "B": 8}, {"relationship": " Trajectories 5 and 9 have significantly different trajectory styles. ", "A": 5, "B": 9}], [{"relationship": " Trajectories 6 and 0 have a similar ending, with trajectory 6 covering a wider spread of the x-axis. ", "A": 6, "B": 0}, {"relationship": " Trajectories 6 and 1 are totally different in trajectory direction, and distance, however, they end at nearly the same z-axis height on the graph. ", "A": 6, "B": 1}, {"relationship": " Trajectories 6 and 2 are different trajectory path wise; also, trajectory 6 is on the left side of the graph while trajectory 2 is more center-based. ", "A": 6, "B": 2}, {"relationship": " Trajectories 6 and 3 start at opposite sides of the graph in that trajectory 3 starts more on the left, and trajectory 6 starts on the right side of the graph. ", "A": 6, "B": 3}, {"relationship": " Trajectories 6 and 4 are similar to a certain extent, however, their direction varies near the halfway point. ", "A": 6, "B": 4}, {"relationship": " Trajectories 6 and 5 have different xy-axis values. ", "A": 6, "B": 5}, {"relationship": " Trajectories 6 and 6 are identical, showing the exact same path and endpoints in 3D space. ", "A": 6, "B": 6}, {"relationship": " Trajectories 6 and 7 are drastically different in the trajectory pattern. ", "A": 6, "B": 7}, {"relationship": " Trajectories 6 and 8 appear to have similar ending heights; however, the xy values seem to be different. ", "A": 6, "B": 8}, {"relationship": " Trajectories 6 and 9 appear to have drastically different starting points and patterns. ", "A": 6, "B": 9}], [{"relationship": " Trajectories 7 and 0 start at different points, but have a similar end goal. ", "A": 7, "B": 0}, {"relationship": " Trajectories 7 and 1 have very different starting points but are not that far apart; however, both end at a similar z-height on the graph. ", "A": 7, "B": 1}, {"relationship": " Trajectories 7 and 2 have similar ending z-axis heights but start at different points on the xy-axis. ", "A": 7, "B": 2}, {"relationship": " Trajectories 7 and 3 have different starting points but the ending z-axis height is the same. ", "A": 7, "B": 3}, {"relationship": " Trajectories 7 and 4 have similar end points with slightly different starting points. ", "A": 7, "B": 4}, {"relationship": " Trajectories 7 and 5 have different starting point, but they have very similar ending heights on the z-axis. ", "A": 7, "B": 5}, {"relationship": " Trajectories 7 and 6 are drastically different in the trajectory pattern. ", "A": 7, "B": 6}, {"relationship": " Trajectories 7 and 7 are identical, showing the exact same path and endpoints in 3D space. ", "A": 7, "B": 7}, {"relationship": " Trajectories 7 and 8 have very different styles and patterns of trajectory, and starting points are totally different. ", "A": 7, "B": 8}, {"relationship": " Trajectories 7 and 9 seem to have totally different xy-axis values. ", "A": 7, "B": 9}], [{"relationship": " Trajectories 8 and 0 start off close, however, their paths differ with trajectory 8 taking a more zig-zag shape. ", "A": 8, "B": 0}, {"relationship": " Trajectories 8 and 1 have a lot of the same movement patterns, but have different starting points and are slightly different distances from the camera. ", "A": 8, "B": 1}, {"relationship": " Trajectories 8 and 2 have different trajectory styles with the former being sharp, while the latter is less angular. ", "A": 8, "B": 2}, {"relationship": " Trajectories 8 and 3 have different starting points but the same ending height on the z-axis of the graph. ", "A": 8, "B": 3}, {"relationship": " Trajectories 8 and 4 have different trajectory patterns but are similar in xy-axis values. ", "A": 8, "B": 4}, {"relationship": " Trajectories 8 and 5 have different path patterns in that trajectory 8 has sharp turns, and trajectory 5 has more of a box. ", "A": 8, "B": 5}, {"relationship": " Trajectories 8 and 6 appear to have similar ending heights; however, the xy values seem to be different. ", "A": 8, "B": 6}, {"relationship": " Trajectories 8 and 7 have very different styles and patterns of trajectory, and starting points are totally different. ", "A": 8, "B": 7}, {"relationship": " Trajectories 8 and 8 are identical, showing the exact same path and endpoints in 3D space. ", "A": 8, "B": 8}, {"relationship": " Trajectories 8 and 9 seem to have totally different path patterns. ", "A": 8, "B": 9}], [{"relationship": " Trajectories 9 and 0 appear to be close on the xy-axis but have different z-axis values; moreover, trajectory 9 starts and ends at slightly different locations on the graph. ", "A": 9, "B": 0}, {"relationship": " Trajectories 9 and 1 share a similar beginning point but end at different point. ", "A": 9, "B": 1}, {"relationship": " Trajectories 9 and 2 are very similar in that one point is closer than the other; overall, they appear to be close and in the same xy-axis. ", "A": 9, "B": 2}, {"relationship": " Trajectories 9 and 3 have drastic differences, with trajectory 3 having a loop while trajectory 9 does not. ", "A": 9, "B": 3}, {"relationship": " Trajectories 9 and 4 have very different trajectory patterns; in addition, the starting points are on opposite sides of the graph. ", "A": 9, "B": 4}, {"relationship": " Trajectories 9 and 5 have significantly different trajectory styles. ", "A": 9, "B": 5}, {"relationship": " Trajectories 9 and 6 appear to have drastically different starting points and patterns. ", "A": 9, "B": 6}, {"relationship": " Trajectories 9 and 7 seem to have totally different xy-axis values. ", "A": 9, "B": 7}, {"relationship": " Trajectories 9 and 8 seem to have totally different path patterns. ", "A": 9, "B": 8}, {"relationship": " Trajectories 9 and 9 are identical, showing the exact same path and endpoints in 3D space.", "A": 9, "B": 9}]]